target/test-classes/xml/ows/TC32133_createOrder.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <ord1:createOrder xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" type="NEW" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd">
      <account type="RESIDENTIAL">
        <contact language="en_GB" type="BILLING">
          <title>Mr</title>
          <firstName/>
          <lastName/>
          <telephoneNumbers defaultContact="daytime">
            <daytime>0398403850</daytime>
            <evening>0208619999</evening>
            <mobile>02086999990</mobile>
          </telephoneNumbers>
          <emailAddress/>
          <birthDate>1975-04-22</birthDate>
        </contact>
        <billingAddress>
          <buildingIdentifier>6</buildingIdentifier>
          <addressLine1>LUKIN STREET</addressLine1>
          <!--<addressLine2>Address Line 2</addressLine2>:-->
          <town>LONDON</town>
          <country>United Kingdom</country>
          <postcode>E10AA</postcode>
          <ptc_abs_code>PTCABS3075103</ptc_abs_code>
          <startDate>1980-08-08</startDate>
        </billingAddress>
        <accountDetail>
          <username/>
          <!--<username>WinnieAutomation6</username>-->
          <password>password1</password>
          <securityQuestion>Mothers maiden name?</securityQuestion>
          <securityAnswer>smith</securityAnswer>
        </accountDetail>
        <billingDetail>
          <billGroupId>422</billGroupId>
          <preferredNotification>SMS</preferredNotification>
          <paymentDetail type="DD">
            <directDebit>
              <bankName>RGMSP8QI2</bankName>
              <sortCode>089999</sortCode>
              <accountNumber>66374958</accountNumber>
              <accountName>MT5J2JYZ1285FVMM</accountName>
            </directDebit>
          </paymentDetail>
          <billFormat>SUMMARY</billFormat>
          <clubcardNumber>634143330730912784</clubcardNumber>
        </billingDetail>
      </account>
      <verification refundableDepositAccepted="false" runCreditCheck="false" termsAndConditionsAccepted="true"/>
      <orderDetail agentId="rainbow" devicePrint="DEVICEPRINT-AA" externalSystemID="COCO" ipAddress="160.206.234.22" orderRef="12345" paymentMethod="CARD" salesChannel="Care (CSA)">
        <dateTime>2011-06-10T16:44:31.0Z</dateTime>
        <!--1 or more repetitions:-->
        <orderItem dealSKU="DEAL-INHAND" id="1">
          <serviceRef reference="Mobile Ref 1">07326505440</serviceRef>
          <!--You have a CHOICE of the next 4 items at this level-->
          <tariff productCode="FC12-1000-500SO">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="HTC-WILDFIRE-XXX-60">
            <deliveryMethod>INHAND</deliveryMethod>
            <imei>137695587771463</imei>
            <serialNumber>123152436457568486784684</serialNumber>
          </device>
          <discBundle bundleGroup="STANDARDDATAFC" productCode="500MB-DATA-500-FC">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
          <discBundle billCapNotifications="false" bundleGroup="SB-GRP-A" productCode="02000-SB-A">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
        </orderItem>
        <paymentRequest>
          <cardName>CardName</cardName>
          <cardNumber>5105105105105100</cardNumber>
          <cardType>MA</cardType>
          <cardExpiryDate>1230</cardExpiryDate>
          <!--CardStartDate is optional as of V8.2-->
          <cardStartDate>0110</cardStartDate>
          <cvv>123</cvv>
        </paymentRequest>
      </orderDetail>
    </ord1:createOrder>
  </soapenv:Body>
</soapenv:Envelope>